
## Plan Result (prod)




<pre><code>Plan: 5 to add, 12 to change, 0 to destroy.</code></pre>

* Create
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password
  * module.sdp_db_user.null_resource.setup_sdp_user[&#34;cft_task_db&#34;]
  * module.wa_task_management_api_database_flexible_replica.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
  * module.wa_task_management_api_database_flexible_replica.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
* Update
  * module.wa_task_management_api_database_flexible.azurerm_monitor_action_group.db-alerts-action-group[0]
  * module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]
  * module.wa_task_management_api_database_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.wa_task_management_api_database_flexible.azurerm_resource_group.rg[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_monitor_action_group.db-alerts-action-group[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_postgresql_flexible_server.pgsql_server
  * module.wa_task_management_api_database_flexible_replica.azurerm_resource_group.rg[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.sdp_db_user.data.azurerm_key_vault.sdp_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "sdp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "mi-vault-prod"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + rbac_authorization_enabled      = (known after apply)
      + resource_group_name             = "mi-prod-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sdp_db_user.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name will be created
  + resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "cft-task-postgres-db-flexible-replica-read-user-name"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password will be created
  + resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "cft-task-postgres-db-flexible-replica-read-user-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.sdp_db_user.null_resource.setup_sdp_user["cft_task_db"] will be created
  + resource "null_resource" "setup_sdp_user" {
      + id       = (known after apply)
      + triggers = {
          + "database"        = "cft_task_db"
          + "fqdn"            = "cft-task-postgres-db-flexible-replica-prod.postgres.database.azure.com"
          + "name"            = "cft-task-postgres-db-flexible-replica"
          + "schemas"         = "cft_task_db"
          + "script_hash"     = "09d8a0c139d2bd77f035b6069cda0083489604daea7bde6a65900fee85b1da84"
          + "sdp_reader_pass" = (sensitive value)
          + "sdp_reader_user" = "SDP_READ_USER"
        }
    }

  # module.wa_task_management_api_database_flexible.azurerm_monitor_action_group.db-alerts-action-group[0] will be updated in-place
  ~ resource "azurerm_monitor_action_group" "db-alerts-action-group" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-data-prod/providers/Microsoft.Insights/actionGroups/cft-task-postgres-db-flexible-wa-support"
        name                = "cft-task-postgres-db-flexible-wa-support"
      ~ tags                = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2026-03-03T17:36:52Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_cpu[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-data-prod/providers/Microsoft.Insights/metricAlerts/db_cpu_percent_cft-task-postgres-db-flexible-prod"
        name                     = "db_cpu_percent_cft-task-postgres-db-flexible-prod"
      ~ tags                     = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2026-03-03T17:36:52Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_memory[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_memory" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-data-prod/providers/Microsoft.Insights/metricAlerts/db_memory_percent_cft-task-postgres-db-flexible-prod"
        name                     = "db_memory_percent_cft-task-postgres-db-flexible-prod"
      ~ tags                     = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2026-03-03T17:36:52Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-data-prod/providers/Microsoft.Insights/metricAlerts/db_storage_utilization_cft-task-postgres-db-flexible-prod"
        name                     = "db_storage_utilization_cft-task-postgres-db-flexible-prod"
      ~ tags                     = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2026-03-03T17:36:52Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-prod"
        name                              = "cft-task-postgres-db-flexible-prod"
      ~ tags                              = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2026-03-03T17:36:52Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-data-prod"
        name       = "cft-task-postgres-db-flexible-data-prod"
      ~ tags       = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2026-03-03T17:36:52Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_monitor_action_group.db-alerts-action-group[0] will be updated in-place
  ~ resource "azurerm_monitor_action_group" "db-alerts-action-group" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod/providers/Microsoft.Insights/actionGroups/cft-task-postgres-db-flexible-wa-support"
        name                = "cft-task-postgres-db-flexible-wa-support"
      ~ tags                = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2026-03-02T14:34:58Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_cpu[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod/providers/Microsoft.Insights/metricAlerts/db_cpu_percent_cft-task-postgres-db-flexible-replica-prod"
        name                     = "db_cpu_percent_cft-task-postgres-db-flexible-replica-prod"
      ~ tags                     = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2026-03-02T14:34:58Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_memory[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_memory" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod/providers/Microsoft.Insights/metricAlerts/db_memory_percent_cft-task-postgres-db-flexible-replica-prod"
        name                     = "db_memory_percent_cft-task-postgres-db-flexible-replica-prod"
      ~ tags                     = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2026-03-02T14:34:58Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod/providers/Microsoft.Insights/metricAlerts/db_storage_utilization_cft-task-postgres-db-flexible-replica-prod"
        name                     = "db_storage_utilization_cft-task-postgres-db-flexible-replica-prod"
      ~ tags                     = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2026-03-02T14:34:58Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-replica-prod"
        name                              = "cft-task-postgres-db-flexible-replica-prod"
      ~ tags                              = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2026-03-02T14:34:58Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-replica-prod"
      + value     = "pg_cron"
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-replica-prod"
      + value     = "on"
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod"
        name       = "cft-task-postgres-db-flexible-replica-data-prod"
      ~ tags       = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2026-03-02T14:34:58Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 5 to add, 12 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1588,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->